{
  "intro" : {
    "dialog" : "NASA Guy: We have received strange readings from the sensors on the moon, it is a cause for concern, we’re sending you, our lead scientist to investigate. Refresh yourself on how these spacecrafts work and then head on your way.~~~{{player}}: hmmm, i dont need the full lesson, lets read the crash course lesson.~~~NASA Guy: Oh, just so you know, everything costs Zhekkos. It's the new universal currency! You can get your daily socialist salary from the nearest ATM. If you're feeling lucky, you can \"Invest\" by visit a slot machine.",
    "automatic": true,
    "singleTrigger": true
  },

  "hydrogenLesson" : {
    "dialog" : "Hydrogen is a chemical element. Its atomic number is 1, which makes it the simplest known element in the entire universe.[4] Hydrogen is the very oldest substance: the first kind of atom produced after the Big Bang. All chemical elements were formed from hydrogen by the processes of nuclear fusion.[5]",
    "automatic": false,
    "singleTrigger": false
  },
  "radioLesson" : {
    "dialog" : "A radio telescope is a type of antenna, like a huge satellite television dish. It is used for radio astronomy. Stars shine and the light can be seen with an ordinary telescope, but they also give off radio waves. Scientists with radio telescopes receive these radio waves and use computers to learn about the stars. Other things like black holes also give off radio waves and radio telescopes are useful for learning about them too.",
    "automatic": false,
    "singleTrigger": false
  },
  "telescopeLesson" : {
    "dialog": "A telescope is an important tool for astronomy that gathers light and directs it to a single point. Some do this with curved mirrors, some with curved lenses, and some with both. Telescopes make distant things look bigger, brighter and closer. Galileo was the first person to use a telescope for astronomy, but he did not invent them. The first telescope was invented in the Netherlands in 1608. Some telescopes, not mainly used for astronomy, are binoculars, camera lenses, or spyglasses.",
    "automatic": false,
    "singleTrigger": false
  },
  "infraredTelescopeLesson" : {
    "dialog": "An infrared telescope is a telescope that detects infrared radiation (heat energy). All objects in the universe that have a temperature above absolute zero give off some form of electromagnetic radiation.[1] Infrared light is one of several types of radiation present in the electromagnetic spectrum.",
    "automatic": false,
    "singleTrigger": false
  },
  "ultravioleteLesson" : {
    "dialog": "Ultraviolet is the part of the electromagnetic spectrum shown on the left side of the picture below as black—because humans cannot see light of such short wavelength (or high frequency). Many animals such as some insects, some reptiles, crocodiles, salamanders, and small birds can see things that reflect this light. UV is a common abbreviation of ultraviolet, mainly used in technical contexts.",
    "automatic": false,
    "singleTrigger": false
  },
  "xrayLesson" : {
    "dialog": "X-radiation is a kind of electromagnetic radiation. X-rays are waves of X-radiation. X-rays have a shorter wavelength, and therefore more energy, than ultraviolet radiation. They have a much shorter wavelength than visible light (the light that we can see). Radiation with shorter wavelengths (more energy) than the X-ray is called Gamma radiation (γ-rays). These are all parts of the electromagnetic spectrum",
    "automatic": false,
    "singleTrigger": false
  },
  "gammaRayLesson" : {
    "dialog": "Gamma rays (γ-rays) are electromagnetic waves with the smallest wavelengths in the electromagnetic spectrum.[1] They were discovered in 1900 by Paul Villard, and named in 1903 by Ernest Rutherford.",
    "automatic": false,
    "singleTrigger": false
  },
  "cosmologyLesson" : {
    "dialog": "Cosmology is the branch of astronomy that deals with the origin, structure, evolution and space-time relationships of the universe.[1][2] NASA defines cosmology as \"The study of the structure and changes in the present universe\".[3] Another definition of cosmology is \"the study of the universe, and humanity's place in it\".[4]",
    "automatic": false,
    "singleTrigger": false
  },
  "observableAstrophysicsLesson" : {
    "dialog": "Observational astrophysics is like astronomy. Like astronomers, observational astrophysicists use telescopes to study the Universe, but observational astrophysicists study the physics of what they see to explain the Universe.",
    "automatic": false,
    "singleTrigger": false
  },
  "theoreticalAstrophysicsLesson" : {
    "dialog": "Theoretical astrophysics uses information from astronomers, theories and mathematics to explain how the Universe works. Cosmology is a type of theoretical astrophysics.",
    "automatic": false,
    "singleTrigger": false
  },
  "generalRelativityLesson" : {
    "dialog": "General relativity is a theory of space and time. The theory was published by Albert Einstein in 1915.[1] The central idea of general relativity is that space and time are two aspects of spacetime. Spacetime is curved when there is gravity, matter, energy, and momentum. The links between these forces are shown in the Einstein field equations.",
    "automatic": false,
    "singleTrigger": false
  },
  "universeLesson" : {
    "dialog": "Universe is the name that we use to describe the collection of all the things that exist in space. It is made of billions of stars and planets and enormous clouds of gas separated by a gigantic empty space which is called the universe.",
    "automatic": false,
    "singleTrigger": false
  },
  "matterLesson" : {
    "dialog": "Matter is the substance of which all material is made. That means objects which have mass. More specifically, they must have rest mass, which is a form of energy that matter has even kinetic energy), is extremely cold (it has no thermal energy), etc. Matter is a word that is sometimes used in varying ways in everyday life, whereas mass is a well-defined concept and quantity at least in physics. They are not the same thing, though they are related.[1]",
    "automatic": false,
    "singleTrigger": false
  },
  "csLesson" : {
    "dialog": "Computer science is the theory, experimentation, and engineering that form the basis for the design and use of computers. It involves the study of algorithms that process, store, and communicate digital information. A computer scientist specializes in the theory of computation and the design of computational systems.[1]",
    "automatic": false,
    "singleTrigger": false
  },
  "integralLesson" : {
    "dialog": "In mathematics, an integral assigns numbers to functions in a way that can describe displacement, area, volume, and other concepts that arise by combining infinitesimal data. Integration is one of the two main operations of calculus, with its inverse operation, differentiation, being the other. Given a function f of a real variable x and an interval [a, b] of the real line, the definite integral",
    "automatic": false,
    "singleTrigger": false
  },
  "sovietLesson" : {
    "dialog": "The Union of Soviet Socialist Republics[b] (USSR),[c] commonly known as the Soviet Union,[d] was a socialist state in Eurasia that existed from 30 December 1922 to 26 December 1991.[8] Nominally a union of multiple national Soviet republics,[e] its government and economy were highly centralized. The country was a one-party state, governed by the Communist Party with Moscow as its capital in its largest republic, the Russian Soviet Federative Socialist Republic (Russian SFSR). Other major urban centres were Leningrad, Kiev, Minsk, Alma-Ata, and Novosibirsk.",
    "automatic": false,
    "singleTrigger": false
  },
  "Albert_EinsteinLesson" : {
    "dialog": "Albert Einstein (/ˈaɪnstaɪn/;[4] German: [ˈalbɛɐ̯t ˈʔaɪnʃtaɪn] (About this soundlisten); 14 March 1879 – 18 April 1955) was a German-born theoretical physicist[5] who developed the theory of relativity, one of the two pillars of modern physics (alongside quantum mechanics).[3][6]:274 His work is also known for its influence on the philosophy of science.[7][8] He is best known to the general public for his mass–energy equivalence formula E = mc2, which has been dubbed \"the world's most famous equation\".[9] He received the 1921 Nobel Prize in Physics \"for his services to theoretical physics, and especially for his discovery of the law of the photoelectric effect\",[10] a pivotal step in the development of quantum theory.",
    "automatic": false,
    "singleTrigger": false
  },
  "PhysicsLesson" : {
    "dialog": "Physics (from Ancient Greek: φυσική (ἐπιστήμη), translit. physikḗ (epistḗmē), lit. 'knowledge of nature', from φύσις phýsis \"nature\")[1][2][3] is the natural science that studies matter[4] and its motion and behavior through space and time and that studies the related entities of energy and force.[5] Physics is one of the most fundamental scientific disciplines, and its main goal is to understand how the universe behaves.[a][6][7][8]",
    "automatic": false,
    "singleTrigger": false
  },
  "Nuclear_WeaponLesson" : {
    "dialog": "A nuclear weapon is an explosive device that derives its destructive force from nuclear reactions, either fission (fission bomb) or from a combination of fission and fusion reactions (thermonuclear bomb). Both bomb types release large quantities of energy from relatively small amounts of matter. The first test of a fission (\"atomic\") bomb released an amount of energy approximately equal to 20,000 tons of TNT (84 TJ).[1] The first thermonuclear (\"hydrogen\") bomb test released energy approximately equal to 10 million tons of TNT (42 PJ). A thermonuclear weapon weighing little more than 2,400 pounds (1,100 kg) can release energy equal to more than 1.2 million tons of TNT (5.0 PJ).[2] A nuclear device no larger than traditional bombs can devastate an entire city by blast, fire, and radiation. Since they are weapons of mass destruction, the proliferation of nuclear weapons is a focus of international relations policy.",
    "automatic": false,
    "singleTrigger": false
  },

  "plutoniumLesson" : {
    "dialog": "Plutonium is a radioactive chemical element with symbol Pu and atomic number 94. It is an actinide metal of silvery-gray appearance that tarnishes when exposed to air, and forms a dull coating when oxidized. The element normally exhibits six allotropes and four oxidation states. It reacts with carbon, halogens, nitrogen, silicon and hydrogen. When exposed to moist air, it forms oxides and hydrides that can expand the sample up to 70% in volume, which in turn flake off as a powder that is pyrophoric. It is radioactive and can accumulate in bones, which makes the handling of plutonium dangerous.",
    "automatic": false,
    "singleTrigger": false
  },

  "graph_theoryLesson" : {
    "dialog": "In mathematics, graph theory is the study of graphs, which are mathematical structures used to model pairwise relations between objects. A graph in this context is made up of vertices, nodes, or points which are connected by edges, arcs, or lines. A graph may be undirected, meaning that there is no distinction between the two vertices associated with each edge, or its edges may be directed from one vertex to another; see Graph (discrete mathematics) for more detailed definitions and for other variations in the types of graph that are commonly considered. Graphs are one of the prime objects of study in discrete mathematics.",
    "automatic": false,
    "singleTrigger": false
  },

  "DijkstraLesson" : {
    "dialog": "Dijkstra's algorithm is an algorithm for finding the shortest paths between nodes in a graph, which may represent, for example, road networks. It was conceived by computer scientist Edsger W. Dijkstra in 1956 and published three years later.[1][2][3]",
    "automatic": false,
    "singleTrigger": false
  },

  "C++Lesson" : {
    "dialog": "C++ (/ˌsiːˌplʌsˈplʌs/ \"see plus plus\") is a general-purpose programming language. It has imperative, object-oriented and generic programming features, while also providing facilities for low-level memory manipulation.",
    "automatic": false,
    "singleTrigger": false
  },

  "STAR_TREKLesson" : {
    "dialog": "Star Trek is an American space opera media franchise based on the science fiction television series created by Gene Roddenberry. The first television series, simply called Star Trek and now referred to as \"The Original Series\", debuted in 1966 and aired for three seasons on the television network NBC. It followed the interstellar adventures of Captain James T. Kirk (William Shatner) and his crew aboard the starship USS Enterprise, a space exploration vessel, built by the United Federation of Planets in the twenty-third century. The Star Trek canon of the franchise includes The Original Series, an animated series, five spin-off television series, the film franchise, and further adaptations in several media.",
    "automatic": false,
    "singleTrigger": false
  },

  "asteroidDodge" : {
    "dialog" : "To exit the moon and ~go to Jupiter, there's an obstacle in the way. We must make it through the asteroid belt that lies between Mars and Jupiter. It's filled with giant lumps of rock and metal, over 200000 of them! It's your job to make it through without getting hit on your way there. The actual asteroid belt isn't as densely packed as this, in fact it's actually very spread out, but that wouldn't be fun, now would it?"
  },

  "ISSIntro1": {
    "dialog" : "Medhi: Gravity acts upon all object within earth's gravitational area. Your spaceship will need to have enough force to push through gravity and escape into outer space. The formula to calculate escape velocity is (2GM/r)**0.5. G is the gravitational constant(6.67x10^-11), M is the mass of the body that we are escaping(kg), r is the radius of the body we are escaping (m).  For NASA specifically we use approximately 11.2 km/s to escape earth.",
    "singleTrigger" : true,
    "automatic" : true
  },
  "ISSIntro2": {
    "dialog" : "Medhi: Spacecraft: to traverse the stars you will need to generate thrust to push you in a desired direction, to do this we use rockets. Space does not have oxygen to combust so we must bring oxygen ourselves. That means we must effectively carry two times as much propellent (fuel and oxygen) to create thrust for our ship. As you add more and more propellent, you must remember you have to bring that propellent with you up into space. So as you add more propellent, you need even more propellent to bring the extra propellent. Luckily for us, outer space has almost zero gravity which means you don’t have to worry about the extra mass from the propellent. However you still must escape the planet first, but NASA compartmentalizes the spaceships so that they drop the sections of the ship that are all out of propellent to save on mass.",
    "singleTrigger" : true,
    "automatic" : true
  },
  "ISSIntro3": {
    "dialog" : "Medhi: Good Luck on your trip to the moon!",
    "singleTrigger" : false
  },

  "MoonIntro1" : {
    "dialog" : "{{player}}: alright, now that i’m on the moon, let's check out the sensors~~~Sensors: Massive energy spike detected, more information can be obtained from the sensors at the Jupiter base. Technician required to reset.",
    "singleTrigger" : true,
    "automatic" : true
  },

  "MoonIntro2" : {
    "dialog" : "Terminal: The moon is considered a natural satellite for earth, a satellite is any object that orbits a planet. Orbiting is the gravitational curved trajectory, in other words an object constantly circling a planet. In an essence, gravity pulls the object down towards the planet, yet enough velocity was added in a sideways direction to constantly pull the object around, effectively miss falling down into the orbital body.~~~Other Terminal: Specs of the Moon: Mass-7.35x10^22 kg, Orbit Distance-3.8x10^5 km,  Diameter-3474 km, Orbit Period-27.3 earth days.",
    "singleTrigger" : true,
    "automatic" : true
  },

  "MoonIntro3" : {
    "dialog" : "Terminal: The main asteroid belt lies between Mars and Jupiter, it contains thousands of asteroids or minor planets. Most of the asteroids are tiny microscopic particles, however they sometimes collide to create larger asteroids.",
    "singleTrigger" : true,
    "automatic" : true
  },

  "MoonIntro4" : {
    "dialog" : "Other Terminal: The four largest asteroids are: Ceres, Vesta, Pallas, Hygiea. Ceres, the largest, contains one-third of the entire mass of the entire belt. Ceres contains water, in solid form that covers the surface of the planet.",
    "singleTrigger" : true,
    "automatic" : true
  },

  "JupiterIntro1" : {
    "dialog" : "{{player}}:  alright time to fight some cour…. Oh wrong game, lets go help my friendos~~~Friendo: Dance to the rhythm of the street~, to the fia……(notices {{player}})~~Friendo: oh hey {{player}}, ily, thanks for coming, please, come into the closet with me,we have cookies~~{{player}}: nah friendo, dont need dis, go die or smthing,~~Friendo: K",
    "singleTrigger" : true,
    "automatic" : true
  },

  "JupiterIntro2" : {
    "dialog" : "NASA Guy: *on comms* Oh hey, ignore the Jupiter scientists, they got knocked in the head or something, anyways can you come to the sun station, right now...its really urgent.~~{{player}}: On my way… beam me up scotty … right i don’t have a teleporter, dang budget cuts.",
    "singleTrigger" : true,
    "automatic" : true
  },

  "JupiterIntro3" : {
    "dialog" : "Terminal: Welcome to the Jupiter expansion for NASA, bringing the future, Today! Did you know, Jupiter was named after the Roman king of gods. Jupiter is the largest planet in terms of volume and mass. Most of Jupiter is made of Hydrogen and Helium, hence called ‘gas giants’, saturn is also considered a ‘gas giant’.",
    "singleTrigger" : true,
    "automatic" : true
  },

  "JupiterIntro4" : {
    "dialog" : "Other Terminal: Gravitational Slingshotting or grav-assist ™ is a patented technique discovered by the Jupiter expansion of NASA in 1959 2030. Using the power of maths and physics we can send probes and shuttles extra far. YAY!",
    "singleTrigger" : true,
    "automatic" : true
  },

  "SunIntro1" : {
    "dialog" : "NASA Guy: Thanks for coming {{player}}, we are in dire times… we all wish it were false but the universe is on the verge of collapse, at first the anomalous readings were fascinating, until we realized there was one conclusion, you are our best scientist, please don’t let the world end.~~{{player}}: i got dis",
    "singleTrigger" : true,
    "automatic" : true
  },

  "SunIntro2" : {
    "dialog" : "NASA Guy: Alright, your our best hope, take this warp drive and put it on your ship, it will create a bubble that distorts space-time. Take this and go to Alpha Centauri, there you will meet our next best astrophysicist, and see what next steps you can take, good luck~~{{player}}: kk",
    "singleTrigger" : true,
    "automatic" : true
  },

  "SunIntro3" : {
    "dialog" : "Terminal: The sun, the source of energy and life for the planet earth. It is much larger in size and mass than earth, and accounts for 99% of the mass of the solar system. It consists mainly of Hydrogen and Helium along with small amounts of oxygen, carbon and neon. Occasionally the sun releases solar flares and this can interrupt telecommunication on earth.",
    "singleTrigger" : true,
    "automatic" : true
  },

  "SunIntro4" : {
    "dialog" : "Other terminal: The sun is currently 4.6 billion years old, eventually the sun will run out of fuel and implode on itself, but that won't occur in the next 5 billion years. Once all the hydrogen reserves run dry, the sun will expand to engulf mercury and venus leaving earth very warm (too warm to live on!). ",
    "singleTrigger" : true,
    "automatic" : true
  },

  "ACIntro1" : {
    "dialog" : "{{player}}:Gg bois im here in AC.~~Someguy who looks like NDT: Hello {{player}}, I have spent many a day thinking of a way to save the universe, using my amazing degree in astrophysics and my incredible intellect and awe striking perception, did i mention i made a book called interstellar physics for citizens in a jiffy? Anyway, the only way to stop the universe from imploding is to travel to the galactic core and defeat the eldritch horror attempt to blow it up",
    "singleTrigger" : true,
    "automatic" : true
  },

  "ACIntro2" : {
    "dialog" : "{{player}}: that…. Doesn't seem like a good idea, are you sure it won't just implode faster? We are literally blowing something up before the universe does.~~Someguy who looks like NDT: well… i’m giving it coin flip odds at it working at all, better than 0 i suppose~~{{player}}: alright if its the best chance we got I will do it.~~Someguy who looks like NDT: alright, take the whole tank of my liquid erchius fuel, if we survive this please send someone to deliver more fuel. Good luck out there.",
    "singleTrigger" : true,
    "automatic" : true
  },

  "EQIntro1" : {
    "dialog" : "{{player}}: ... What's that??????~~NASA: OH FU-floppy disk!!!!! You're basically screwed. According to my observations, the entire universe is collapsing....~~{{player}}: .... uhhhh~~NASA: Yeah... you're on your own. Mission control, signing out.",
    "singleTrigger" : true,
    "automatic" : true
  },

  "EQIntro2" : {
    "dialog" : "Elon Musk: HELLOOOOOOOO!!!! I AM COMMINICATING TO YOU VIA TESLA MIND LINK.~~{{player}}: ???? Whot the sheet metal do you want?~~Elon Musk: KEEP GOING!!!! ENTER THE SAFEROOM AND ACTIVATE IT BEFORE YOU GET TORN APART!!!!",
    "singleTrigger" : true,
    "automatic" : true
  },

  "EQIntro3" : {
    "dialog" : "Elon Musk: Hurry up!!! THE FUTURE OF TESL--I mean the universe depends on it!!!",
    "singleTrigger" : true,
    "automatic" : true
  },

  "ending" : {
    "dialog" : "Some guy that looks like NDT: Ruin has come to our universe.~~~~~~~~ We all remember our venerable earth, opulent and imperial.~Gazing proudly from its stoic place in the solar system.~I lived most of my years on that ancient, majestic planet.~~~~In my younger years I was fattened by decadence and luxury.~~~~And yet, I began to tire of conventional extravagance.~~~~Singular, mystical tales suggested that the stars itself was a gateway to some fabulous and unnamable power.~~~~With research and prayer, I bent every effort towards the discovery and advancement of astrophysics,~exhausting much of our family fortune on lab-coated scientists and expansive telescopes.~~~~At last, under the rock filled surface we unearthed liquid erchius fuel.~~~~Now the universe was within our fingertips, but the universe was not ready for us.~~~~Survival … a hollow and ridiculous notion.~~~~The stars, we were born of it, made from it, and we will be returned to it.~~~~Returned to the infinite blackness of space and time.~~~~~~~~~~Ruin has come to our universe.~~~~~~~~The end."
  }
}